app/controllers/restaurants_controller.rb

	def create
		@restaurant = Restaurant.new(restaurant_params.merge(user: current_user))
		if @restaurant.save
---
INSERT INTO "restaurants" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "KFC"], ["user_id", 104], ["created_at", "2015-12-20 16:21:10.726196"], ["updated_at", "2015-12-20 16:21:10.726196"]]

	def update
		@restaurant = Restaurant.find(params[:id])
		@restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 52]]
UPDATE "restaurants" SET "name" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["name", "Kentucky Fried Chicken"], ["updated_at", "2015-12-19 13:44:38.525089"], ["id", 52]]

	def destroy
		@restaurant = Restaurant.find(params[:id])
		if @restaurant.user != current_user
			redirect_to restaurants_path, alert: 'You can only delete a restaurant that you have created'
		else
			@restaurant.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 67]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 67]]