app/controllers/reviews_controller.rb

	def create
		@restaurant = Restaurant.find(params[:restaurant_id])
		@review = @restaurant.reviews.build(review_params.merge(user: current_user))

		if @review.save
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 18]]
INSERT INTO "reviews" ("thoughts", "rating", "user_id", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "so, so"], ["rating", 3], ["user_id", 204], ["restaurant_id", 584], ["created_at", "2015-12-20 18:24:24.012353"], ["updated_at", "2015-12-20 18:24:24.012353"]]

	def destroy
		@review = Restaurant.reviews.find(params[:restaurant_id])
		if @review.user != current_user
			redirect_to restaurants_path, alert: 'You can only delete a review that you have created'
		else
			@review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 85]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 85]]